package weiboclock

var (
	// Words 微博文字
	Words = []string{
		"biu! ", "ha! ", "mua~ ", "dang! ", "ho! ", "hei! ", "pia! ", "dong~ ",
		"he! ", "mia~ ", "ao~ ", "do~ ", "ga~ ", "bi! ", "ba~ ", "ma~ ", "miao~ ",
		"pa! ", "no~ ", "bomb! ", "yeah~ ", "ka! ", "la~ ", "da! ", "OA! ", "meow~ ",
	}

	// Moods 微博表情
	Moods = []string{
		"(°ー°〃)", "_(:з」∠)_ ", "o(*≧▽≦)ツ┏━┓", "๑乛◡乛๑ ", "(σ‘・д･)σ", "( ＿ ＿)ノ｜", "┑(￣Д ￣)┍",
		"[放电抛媚][霹雳][霹雳][霹雳][被电]", "(＃°Д°)", "(-ω- )", "(′・ω・`)", "( ^ω^)", "乀(ˉεˉ乀)",
		"\\(╯-╰)/", "\\(▔▽▔)/", "^(oo)^", "(O^~^O)", "（╯＾╰）", "(*ﾟ∀ﾟ*)", "(శωశ)", "(*´∀`)~♥", "σ`∀´)σ",
		"(〃∀〃)", "(^_っ^)", "(｡◕∀◕｡)", "ヽ(✿ﾟ▽ﾟ)ノ", "ε٩(๑> ₃ <)۶з", "(σ′▽‵)′▽‵)σ", "σ ﾟ∀ ﾟ) ﾟ∀ﾟ)σ",
		"｡:.ﾟヽ(*´∀`)ﾉﾟ.:｡", "(✪ω✪)", "(∂ω∂)", "─=≡Σ((( つ•̀ω•́)つ", "(๑´ڡ`๑)", "(´▽`ʃ♡ƪ)", "(❛◡❛✿)", "(灬ºωº灬)",
		"(￣▽￣)/", "╰(*°▽°*)╯", "(๑•̀ㅂ•́)و✧", "( ^ω^)", "٩(｡・ω・｡)و", "( ～'ω')～", "(๑ơ ₃ ơ)♥", "(ﾉ◕ヮ◕)ﾉ*:･ﾟ✧",
		"o(☆Ф∇Ф☆)o", "(￫ܫ￩)", "(♥д♥)", "✧◝(⁰▿⁰)◜✧", "(ᗒᗨᗕ)/", "(=´ω`=)", "(｢･ω･)｢", "(*´д`)", "Σ>―(〃°ω°〃)♡→",
		"(▰˘◡˘▰)", "ヾ(´ε`ヾ)", "(っ●ω●)っ", "◥(ฅº￦ºฅ)◤", "ヽ( ° ▽°)ノ", "(　ﾟ∀ﾟ) ﾉ♡", "✧*｡٩(ˊᗜˋ*)و✧*｡",
		"⁽⁽◟(∗ ˊωˋ ∗)◞ ⁾⁾", "ヾ(´︶`*)ﾉ♬", "ヾ(*´∀ ˋ*)ﾉ", "(๑•̀ω•́)ノ", "ヾ (o ° ω ° O ) ノ゙ ", "╮(╯_╰)╭", "(๑•́ ₃ •̀๑)",
		"(´･_･`)", "(ㆆᴗㆆ)", "┐(´д`)┌", "( ˘･з･)", "( ´•︵•` )", "(｡ŏ_ŏ)", "(◞‸◟)", "( ˘•ω•˘ )", "(눈‸눈)", "(´･ω･`)",
		"(*´艸`*)", "(〃∀〃)", "(つд⊂)", "(๑´ㅂ`๑)", "ε٩(๑> ₃ <)۶з", "(๑´ڡ`๑)", "(灬ºωº灬)", "(๑• . •๑)",
		"(๑ơ ₃ ơ)♥", "(●｀ 艸´)", ",,Ծ‸Ծ,,", "(〃ﾟдﾟ〃)", "(๑´ㅁ`)", "(๑¯∀¯๑)", "(〃´∀｀)", "(⋟﹏⋞)", "(ノдT)",
		"(T_T)", "：ﾟ(｡ﾉω＼｡)ﾟ･｡", "(TдT)", "(☍﹏⁰)", "(╥﹏╥)", "｡ﾟ(ﾟ´ω`ﾟ)ﾟ｡", "இдஇ", "｡ﾟヽ(ﾟ´Д`)ﾉﾟ｡", "。･ﾟ･(つд`ﾟ)･ﾟ･",
		"・゜・(PД`q｡)・゜・", "(ﾟд⊙)", "(‘⊙д-)", "Σ(*ﾟдﾟﾉ)ﾉ", "(((ﾟДﾟ;)))", "(((ﾟдﾟ)))", "(☉д⊙)", "(|||ﾟдﾟ)",
		"(´⊙ω⊙`)", "ฅ(๑*д*๑)ฅ!!", "(゜ロ゜)", "(✘﹏✘ა)", "(✘Д✘๑ )", "(╬☉д⊙)", "(／‵Д′)／~ ╧╧", "(╯‵□′)╯︵┴─┴",
		"(◓Д◒)✄╰⋃╯", "(ﾒﾟДﾟ)ﾒ", "(`へ´≠)", "(#ﾟ⊿`)凸", "(╬▼дﾟ)", "(ᗒᗣᗕ)՞", "( ิ◕㉨◕ ิ)", "(❍ᴥ❍ʋ)", "(◕ܫ◕)", "(ΦωΦ)",
		"ก็ʕ•͡ᴥ•ʔ ก้", "(=´ω`=)", "(⁰⊖⁰)", "(=´ᴥ`)", "ฅ●ω●ฅ", "( ° ͜ʖ͡°)╭∩╮", "(⌐▀͡ ̯ʖ▀)", "(･ิω･ิ)", "ʕ•̀ω•́ʔ✧", "٩(♡ε♡ )۶", "٩(๑´3｀๑)۶",
		"(๑•̀ㅁ•́๑)✧", "•̀.̫•́✧", "⁄(⁄ ⁄•⁄ω⁄•⁄ ⁄)⁄", "⁽⁽٩(๑˃̶͈̀ ᗨ ˂̶͈́)۶⁾⁾", "( •̀ᄇ• ́)ﻭ✧", "(▭-▭)✧", "(▭-▭)✧", "ଘ(⊃ˊᵕˋ)⊃━☆’･*:.｡",
		"(⸝⸝⸝ᵒ̴̶̥́ ⌑ ᵒ̴̶̣̥̀⸝⸝⸝)", "((̵̵́ ̆͒͟˚̩̭ ̆͒)̵̵̀)ﾞ", "o̖⸜((̵̵́ ̆͒͟˚̩̭ ̆͒)̵̵̀)⸝o̗", "٩(ˊᗜˋ*)و", "(∩ᵒ̴̶̷̤⌔ᵒ̴̶̷̤∩)", "₍₍ ◟꒰ ‾᷅д̈ ‾᷄ ╬꒱", "ଘ(੭ˊ꒳ˋ)੭✧", "ʕ·͡·̫͖ʕ⁎̯͡⁎ʔ",
		"ʕ•̫͡•ʕ•̫͡•ʔ•̫͡•ʔ", "(๑‾᷆д‾᷇๑)Fightᵎᵎ", "꒰｡⁻௰⁻｡꒱",
		"[武汉加油]", "[点亮平安灯]", "[炸鸡腿]", "[中国赞]", "[锦鲤]", "[抱抱]", "[摊手]", "[跪了]", "[酸]",
		"[花木兰]", "[BB8]", "[冰雪奇缘艾莎]", "[微笑]", "[可爱]", "[太开心]", "[鼓掌]", "[嘻嘻]", "[哈哈]",
		"[笑cry]", "[挤眼]", "[馋嘴]", "[黑线]", "[汗]", "[挖鼻]", "[哼]", "[怒]", "[委屈]", "[可怜]", "[失望]",
		"[悲伤]", "[泪]", "[允悲]", "[害羞]", "[污]", "[爱你]", "[亲亲]", "[色]", "[憧憬]", "[舔屏]", "[坏笑]",
		"[阴险]", "[笑而不语]", "[偷笑]", "[酷]", "[并不简单]", "[思考]", "[疑问]", "[费解]", "[晕]", "[衰]",
		"[骷髅]", "[嘘]", "[闭嘴]", "[傻眼]", "[吃惊]", "[吐]", "[感冒]", "[生病]", "[拜拜]", "[鄙视]", "[白眼]",
		"[左哼哼]", "[右哼哼]", "[抓狂]", "[怒骂]", "[打脸]", "[顶]", "[互粉]", "[钱]", "[哈欠]", "[困]", "[睡]",
		"[吃瓜]", "[doge]", "[二哈]", "[喵喵]", "[赞]", "[good]", "[ok]", "[耶]", "[握手]", "[作揖]", "[来]", "[拳头]",
		"[心]", "[伤心]", "[鲜花]", "[男孩儿]", "[女孩儿]", "[熊猫]", "[兔子]", "[猪头]", "[草泥马]", "[奥特曼]", "[太阳]",
		"[月亮]", "[浮云]", "[下雨]", "[沙尘暴]", "[微风]", "[围观]", "[飞机]", "[照相机]", "[话筒]", "[蜡烛]", "[音乐]",
		"[喜]", "[给力]", "[威武]", "[干杯]", "[蛋糕]", "[礼物]", "[钟]", "[肥皂]", "[绿丝带]", "[围脖]", "[浪]", "[羞嗒嗒]",
		"[好爱哦]", "[偷乐]", "[赞啊]", "[笑哈哈]", "[好喜欢]", "[求关注]", "[胖丁微笑]", "[弱]", "[NO]", "[haha]", "[加油]",
		"[佩奇]", "[大侦探皮卡丘微笑]", "[圣诞老人]", "[紫金草]", "[文明遛狗]", "[神马]", "[马到成功]", "[炸鸡啤酒]", "[最右]",
		"[织]", "[五仁月饼]", "[给你小心心]", "[吃狗粮]", "[弗莱见钱眼开]", "[点亮橙色]", "[超新星全运会]", "[看涨]", "[看跌]",
		"[带着微博去旅行]", "[星星]", "[半星]", "[空星]", "[蕾伊]", "[凯洛伦]", "[BB8]", "[冲锋队员]", "[达斯维达]", "[C3PO]",
		"[丘巴卡]", "[R2D2]", "[哆啦A梦花心]", "[哆啦A梦害怕]", "[哆啦A梦吃惊]", "[哆啦A梦汗]", "[哆啦A梦微笑]", "[伴我同行]",
		"[静香微笑]", "[大雄微笑]", "[胖虎微笑]", "[小夫微笑]", "[哆啦A梦笑]", "[哆啦A梦无奈]", "[哆啦A梦美味]", "[哆啦A梦开心]",
		"[哆啦A梦亲亲]", "[小黄人微笑]", "[小黄人剪刀手]", "[小黄人不屑]", "[小黄人高兴]", "[小黄人惊讶]", "[小黄人委屈]",
		"[小黄人坏笑]", "[小黄人白眼]", "[小黄人无奈]", "[小黄人得意]", "[钢铁侠]", "[美国队长]", "[雷神]", "[浩克]",
		"[黑寡妇]", "[鹰眼]", "[惊奇队长]", "[奥克耶]", "[蚁人]", "[灭霸]", "[蜘蛛侠]", "[洛基]", "[奇异博士]", "[冬兵]",
		"[黑豹]", "[猩红女巫]", "[幻视]", "[星爵]", "[格鲁特]", "[螳螂妹]", "[无限手套]", "[胖红拽]", "[胖红生气]", "[胖红微笑]",
		"[飞镖黄跳舞]", "[炸弹黑hi]", "[三三蹦跳]", "[小V开心]", "[小V生气]", "[佐伊卖萌]", "[小猪惊讶]", "[哪吒委屈]",
		"[哪吒得意]", "[哪吒开心]", "[大毛略略]", "[大毛惊讶]", "[大毛微笑]",
	}
)
